test/ContentDirectory/Browse.http

POST http://192.168.0.7:1400/MediaServer/ContentDirectory/Control HTTP/1.1
SOAPAction: urn:schemas-upnp-org:service:ContentDirectory:1#Browse

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <s:Body>
    <u:Browse xmlns:u="urn:schemas-upnp-org:service:ContentDirectory:1">
      <ObjectID>SQ:</ObjectID>
      <BrowseFlag>BrowseDirectChildren</BrowseFlag>
      <Filter>*</Filter>
      <StartingIndex>0</StartingIndex>
      <RequestedCount>1</RequestedCount>
      <SortCriteria>+dc:title</SortCriteria>
    </u:Browse>
  </u:Body>
</s:Envelope>